app/controllers/profiles_controller.rb

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = 3 LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = 3  ORDER BY "users"."id" ASC LIMIT 1
---
def myprofile
profile = Profile.find_by_user_id(current_user.id)
if profile.nil?
redirect_to "/profiles/new"
else
@user = User.find(current_user.id)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 3  ORDER BY "users"."id" ASC LIMIT 1
---
def new
@user = User.find(current_user.id)

INSERT INTO "profiles" ("course", "created_at", "firstname", "lastname", "mobile", "studentno", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @profile = Profile.new(profile_params)
    @profile.save