app/controllers/quests_controller.rb

  def index
    @quests = Quest.all
---
SELECT "quests".* FROM "quests"

    def set_quest
      @quest = Quest.find(params[:id])
---
SELECT  "quests".* FROM "quests"  WHERE "quests"."id" = ? LIMIT 1  [["id", 0]]